
detectives = {'Зарубежные детективы', 'Крутой детектив', 'Политические детективы', 'Шпионские детективы',
              'Иронические детективы', 'Классические детективы', 'Триллеры', 'Полицейские детективы',
              'Современные детективы', 'Исторические детективы'}

love_romane = {'Зарубежные любовные романы', 'Короткие любовные романы', 'Исторические любовные романы',
               'Остросюжетные любовные романы', 'Современные любовные романы'}

erotic = {'Эротические романы', 'Секс / секс-руководства', 'Эротика ЛГБТ', 'Эротическая литература',
          'Эротические рассказы и истории', 'Эротическое фэнтези'}

horror = {'Мистика', 'Ужасы'}   

thriller = {'Боевая фантастика', 'Криминальные боевики', 'Зарубежные боевики'}

humor = {'Зарубежный юмор', 'Анекдоты', 'Юмористические стихи', 'Юмористическая проза', 'Юмор и сатира'}

adventure = {'Зарубежные приключения', 'Исторические приключения', 'Книги о путешествиях', 'Вестерны',
             'Морские приключения', 'Книги о приключениях', 'Классика приключенческой литературы', 'Комиксы / манга'}

classic = {'Литература 20 века', 'Зарубежная классика', 'Классическая проза', 'Русская классика',
           'Советская литература', 'Литература 19 века', 'Древневосточная литература',
           'Зарубежная старинная литература', 'Мифы / легенды / эпос', 'Европейская старинная литература',
           'Литература 18 века', 'Античная литература', 'Фольклор', 'Древнерусская литература', 'Старинная литература'}

poetry = {'Стихи и поэзия', 'Зарубежная поэзия', 'Русская поэзия'}

play = {'Пьесы и драматургия', 'Зарубежная драматургия', 'Русская драматургия'}

history = {'Биографии и мемуары', 'Историческая литература', 'Историческая фантастика', 'Документальная литература',
           'Книги о войне', 'Историческое фэнтези'}

popular_science = {'Научно-популярная литература'}

esoterics = {'Эзотерика', 'Практическая эзотерика', 'Зарубежная эзотерическая литература', 'Эзотерика / оккультизм',
             'Магия / колдовство', 'Спиритизм / пророчества / предсказания', 'Астрология', 'Гадание / толкование снов',
             'Современные религиозные течения', 'Парапсихология', 'Фэншуй / фэн-шуй'}

culture = {'Кинематограф / театр', 'Зарубежная литература о культуре и искусстве', 'Изобразительное искусство',
           'Музыка', 'Дизайн', 'Искусствоведение', 'История искусства', 'Архитектура', 'Критика', 'Музеи и коллекции',
           'Опера / балет', 'Танцы', 'Телевидение', 'Ноты', 'Цирк'}

parents = {'Воспитание детей'}

health = {'Медицина и здоровье', 'Альтернативная медицина', 'Здоровье', 'Похудение и диеты', 'Популярно о медицине',
          'Здоровое и правильное питание', 'Здоровье детей', 'Народная и нетрадиционная медицина', 'Спорт', 'Йога',
          'Спорт / фитнес', 'Косметика и косметология', 'Прически / уход за волосами', 'Парикмахерское дело'}

business = {'Зарубежная деловая литература', 'О бизнесе популярно', 'Эффективность бизнеса', 'Просто о бизнесе',
            'Советы от гуру', 'Бизнес-стратегии', 'Истории успеха', 'Российская практика', 'Консалтинг',
            'Креатив / идеи', 'Инновации в бизнесе', 'Бизнес-план', 'Привлечение инвестиций', 'Организация офиса',
            'Слияния и поглощения', 'Работа с долгами', 'Выход из бизнеса', 'Интернет-бизнес', 'Маркетинг, PR, реклама',
            'Привлечение клиентов', 'Интернет-маркетинг', 'Стратегия маркетинга', 'Управление маркетингом', 'Брендинг',
            'Копирайтинг', 'Отношения с клиентами', 'Реклама', 'Клиентский сервис', 'Классический маркетинг',
            'Лояльность', 'Маркетинговые исследования и анализ', 'Маркетинг для новичков', 'PR', 'Директ-маркетинг',
            'Мерчендайзинг', 'Управление ассортиментом', 'Событийный маркетинг', 'Партизанский маркетинг',
            'Product placement', 'Личная эффективность', 'Кадровый менеджмент', 'Мотивация', 'Коучинг',
            'Управление персоналом', 'Поиск и подбор персонала', 'Тимбилдинг', 'Конфликты', 'Гендерные различия',
            'Аттестация персонала', 'Личные финансы', 'Ценные бумаги / инвестиции', 'Менеджмент',
            'Финансовый менеджмент', 'Организационный менеджмент', 'Управление бизнесом', 'Бизнес-процессы',
            'Управление персоналом', 'Лидерство', 'Project-менеджмент', 'Производственный менеджмент', 'IT-менеджмент',
            'Стратегический менеджмент', 'Классика менеджмента', 'Кризисное управление', 'Управление качеством',
            'Японский менеджмент', 'MBA', 'Финансы', 'Трейдинг', 'Финансовые инструменты', 'Риски',
            'Корпоративные финансы', 'Forex', 'Бюджетирование', 'IPO', 'Технический анализ', 'МСФО',
            'Малый и средний бизнес', 'Продажи', 'Управление продажами', 'Техника продаж', 'Успешные переговоры',
            'Эффективная презентация', 'Холодные продажи', 'Дистрибуция', 'Экономика', 'Мировая экономика',
            'Книги по экономике', 'История экономики', 'Экономическое развитие', 'Экономический анализ',
            'Экономика развитых стран', 'Экономическая статистика', 'Экономика развивающихся стран',
            'Экономическая география', 'Макроэкономика', 'Внешнеэкономическая деятельность', 'Управление экономикой',
            'Отраслевая и межотраслевая экономика', 'История экономических учений', 'Общая экономическая теория',
            'Микроэкономика', 'Менеджмент и кадры', 'Тайм-менеджмент', 'Переговоры', 'Ораторское искусство / риторика',
            'Корпоративная культура', 'Стартапы и создание бизнеса', 'Работа с клиентами', 'Делопроизводство',
            'Поиск работы / карьера', 'Банковское дело', 'Бухучет / налогообложение / аудит', 'Недвижимость',
            'Отраслевые издания', 'Финансы, инвестиции, экономика', 'Психология',
            'Личная эффективность / продуктивность', 'Управление персоналом и лидерство', 'Бизнес-процессы / инновации',
            'Переговоры и продажи', 'Маркетинг и реклама', 'Истории успеха и биографии', 'Наука и технологии',
            'Здоровый образ жизни / фитнес', 'Семья, дети, воспитание', 'Государственное и муниципальное управление',
            'Логистика', 'Политическое управление', 'Бизнес-справочники'}

fantasy = {'Фанфик', 'Попаданцы', 'Зарубежная фантастика', 'Юмористическая фантастика', 'Социальная фантастика',
           'Космическая фантастика', 'Детективная фантастика', 'Любовно-фантастические романы',
           'Героическая фантастика', 'Научная фантастика', 'Киберпанк', 'Стимпанк', 'Зарубежное фэнтези',
           'Боевое фэнтези', 'Любовное фэнтези', 'Фэнтези про драконов', 'Русское фэнтези', 'Юмористическое фэнтези',
           'Книги про волшебников', 'Городское фэнтези', 'Книги про вампиров', 'Детективное фэнтези',
           'Героическое фэнтези', 'Магические академии'}

hobby = {'Хобби / увлечения', 'Рукоделие и ремесла', 'Мода и стиль', 'Прикладная литература', 'Кулинария', 'Сделай сам',
         'Природа и животные', 'Искусство фотографии', 'Путеводители', 'Отдых / туризм', 'Сад и огород', 'Развлечения',
         'Интеллектуальные игры', 'Автомобили и ПДД', 'Рыбалка', 'Охота', 'Домашнее хозяйство', 'Хобби / увлечения',
         'Рукоделие и ремесла', 'Сделай сам', 'Домашние животные', 'Природа и животные', 'Отдых / туризм', 'Интерьеры',
         'Сад и огород', 'Автомобили и ПДД', 'Ремонт в квартире', 'Комнатные растения', 'Охота', 'Рыбалка'}

periodics = {'Публицистическая литература', 'Популярно об истории', 'Военное дело / спецслужбы',
             'Зарубежная публицистика', 'Публицистика', 'Афоризмы и цитаты', 'Подкасты', 'Семейные подкасты',
             'Познавательные подкасты', 'Юмористические подкасты', 'Музыкальные подкасты', 'Новостные подкасты',
             'Развлекательные подкасты', 'Творческие подкасты', 'Образовательные подкасты', 'Спортивные подкасты',
             'Газеты', 'Журналы', 'Сборники', 'Альманахи'}

psychology = {'Книги по психологии', 'Саморазвитие / личностный рост', 'Зарубежная психология', 'Практика психологии',
              'Практическая психология', 'Клиническая психология', 'Нейропсихология', 'Психологические тренинги',
              'Психотерапия', 'Психологическая консультация', 'Транзакционный анализ', 'НЛП', 'Психоанализ',
              'Психологические тесты', 'Статистика в психологии', 'Состояния и явления психики',
              'О психологии популярно', 'Социальная психология', 'Семейная психология', 'Детская психология',
              'Общая психология', 'Секс и отношения', 'Любовь и отношения', 'Психология управления',
              'Возрастная психология', 'Классики психологии', 'Основы психологии', 'Отраслевая психология',
              'Развитие психики', 'История психологии', 'Соционика'}

religion = {'Религия и духовная литература', 'Духовная литература', 'Религиоведение / история религий', 'Буддизм',
            'Тибетский буддизм', 'Вероучения в буддизме', 'Дзэн-буддизм', 'Зарубежная религиозная литература',
            'Индийские религии', 'Христианство', 'Православное христианство', 'Православие', 'Богословие',
            'Священное Писание', 'Житийная литература', 'Православные традиции', 'Православные молитвы',
            'Православие для детей', 'История православной церкви', 'Православные каноны', 'Акафисты',
            'Воскресная школа', 'Православные календари', 'Книги для священнослужителей', 'Православная медицина',
            'Религии / верования / культы', 'Иудаизм', 'Религиозные тексты', 'Ислам', 'Ислам / мусульманство',
            'Коран / пророки', 'Молитвы в исламе', 'Христианское искусство', 'Даосизм / конфуцианство', 'Протестантизм',
            'Католицизм', 'Паломничество'}

study = {'Учебная и научная литература', 'Медицина / здравоохранение', 'Нейробиология', 'Вирусология',
         'Акушерство и гинекология', 'Геронтология', 'Кардиология', 'Медицина', 'Клиническая медицина', 'Психиатрия',
         'Иммунология и аллергология', 'Ортопедия и травматология', 'Генетика', 'Эндокринология',
         'Педиатрия и неонатология', 'Неврология', 'Урология и нефрология', 'Онкология', 'Фармакология',
         'Микробиология', 'Прикладные отрасли медицины', 'Оториноларингология', 'Гастроэнтерология', 'Хирургия',
         'Фармация', 'Стоматология', 'Эпидемиология', 'Дерматология', 'Офтальмология', 'Наркология', 'Паразитология',
         'Общая патология', 'Анестезиология', 'Токсикология', 'Гигиена', 'Реаниматология', 'Фтизиатрия и пульмонология',
         'Асептика и антисептика', 'Венерология', 'Учебники и пособия для вузов', 'Гуманитарные и общественные науки',
         'Филология', 'Литературоведение', 'Языкознание', 'Русский язык', 'Историческая научная и учебная литература',
         'История России', 'Общая история', 'Всемирная история', 'История Древнего мира', 'История Средних веков',
         'Этнография', 'Новейшая история', 'Источниковедение', 'Новое время', 'Археология', 'Хронология',
         'Первобытное общество', 'Социология', 'Политика', 'Политология', 'Современное политическое положение',
         'Внешняя политика', 'История политических учений', 'Национальная политика', 'Внутренняя политика',
         'Политические партии', 'Общественные организации', 'Философия', 'Социальная философия', 'Книги по философии',
         'История философии', 'Метафизика', 'Логика', 'Этика', 'Эстетика', 'Культурология', 'Изучение языков',
         'Иностранные языки', 'Русский язык как иностранный', 'Английский язык', 'Французский язык', 'Немецкий язык',
         'Польский язык', 'Испанский язык', 'Итальянский язык', 'Юридическая литература', 'Криминалистика',
         'Юриспруденция', 'Уголовное право', 'Уголовно-процессуальное право', 'Гражданское процессуальное право',
         'Гражданское право', 'Теория государства и права', 'Законы, нормативные акты4 поджанра', 'Правоведение',
         'Криминология', 'Административное право', 'История права', 'Финансовое право', 'Судебное право',
         'Трудовое право', 'Адвокатура', 'Налоговое право', 'Предпринимательское право', 'Земельное право',
         'Конституционное право', 'Семейное право', 'Уголовно-исполнительное право', 'Международное право',
         'Таможенное право', 'Арбитражное процессуальное право', 'Коммерческое право', 'Муниципальное право',
         'Страховое право', 'Органы юстиции', 'Военное право', 'Акционерное право', 'Культура и просвещение',
         'СМИ / Средства массовой информации', 'Физкультура и спорт', 'Издательское дело',
         'Памятники истории и культуры', 'Социокультурная деятельность', 'Музейное дело', 'Архивное дело',
         'Библиография', 'Педагогика', 'Учебная и научная литература по психологии', 'Учебники по психологии',
         'Научная литература по психологии', 'Естественные науки', 'Физика', 'Биология', 'Нейробиология',
         'Анатомия и физиология', 'Общая биология', 'Вирусология', 'Антропология', 'Генетика', 'Зоология', 'Биохимия',
         'Ботаника', 'Микробиология', 'Палеонтология', 'Паразитология', 'Механика', 'Астрономия', 'Математика', 'Химия',
         'Общая химия', 'Биохимия', 'Неорганическая химия', 'Аналитическая химия', 'Органическая химия', 'Фармация',
         'Физическая химия', 'Коллоидная химия', 'Химия полимеров', 'Науки о Земле', 'География', 'Геология',
         'Геодезия', 'Естествознание', 'Экология', 'Школьные учебники', 'Список школьной литературы 10-11 класс', 'ЕГЭ',
         'ЕГЭ по иностранному языку', 'ЕГЭ по русскому языку', 'ЕГЭ по физике', 'ЕГЭ по обществознанию',
         'ЕГЭ по литературе', 'ЕГЭ по биологии', 'ЕГЭ по истории', 'ЕГЭ по математике', 'ЕГЭ по информатике и ИКТ',
         'ЕГЭ по химии', 'ЕГЭ по географии', 'Школьные учебники по английскому языку', 'Учебники 11 класс',
         'Иностранный язык 11 класс', 'Физика 11 класс', 'Обществознание 11 класс', 'Информатика 11 класс',
         'Русский язык 11 класс', 'География 11 класс', 'Литература 11 класс', 'История 11 класс', 'Геометрия 11 класс',
         'Химия 11 класс', 'Алгебра 11 класс', 'Экономика 11 класс', 'Биология 11 класс', 'Астрономия 11 класс',
         'Естествознание 11 класс', 'Мировая художественная культура (МХК) 11 класс',
         'Основы безопасности жизнедеятельности (ОБЖ) 11 класс', 'Право 11 класс', 'Технология 11 класс',
         'Физкультура 11 класс', 'Экология 11 класс', 'ГИА (ОГЭ, ГВЭ)', 'ГИА по иностранному языку (ОГЭ, ГВЭ)',
         'ГИА по русскому языку (ОГЭ, ГВЭ)', 'ГИА по математике (ОГЭ, ГВЭ)', 'ГИА по обществознанию (ОГЭ, ГВЭ)',
         'ГИА по географии (ОГЭ, ГВЭ)', 'ГИА по информатике и ИКТ (ОГЭ, ГВЭ)', 'ГИА по истории (ОГЭ, ГВЭ)',
         'ГИА по физике (ОГЭ, ГВЭ)', 'ГИА по литературе (ОГЭ, ГВЭ)', 'ГИА по биологии (ОГЭ, ГВЭ)',
         'ГИА по химии (ОГЭ, ГВЭ)', 'Рабочие тетради / прописи', 'Школьные методические пособия', 'Учебники 2 класс',
         'Русский язык 2 класс', 'Чтение 2 класс', 'Иностранный язык 2 класс', 'Окружающий мир 2 класс',
         'Математика 2 класс', 'Технология 2 класс', 'Изобразительное искусство (ИЗО) 2 класс', 'Музыка 2 класс',
         'Информатика 2 класс', 'Физкультура 2 класс', 'Учебники 10 класс', 'Русский язык 10 класс', 'Физика 10 класс',
         'Литература 10 класс', 'География 10 класс', 'Информатика 10 класс', 'Иностранный язык 10 класс',
         'Химия 10 класс', 'Геометрия 10 класс', 'Обществознание 10 класс', 'Экономика 10 класс', 'История 10 класс',
         'Алгебра 10 класс', 'Биология 10 класс', 'Естествознание 10 класс',
         'Мировая художественная культура (МХК) 10 класс', 'Основы безопасности жизнедеятельности (ОБЖ) 10 класс',
         'Право 10 класс', 'Технология 10 класс', 'Физкультура 10 класс', 'Экология 10 класс', 'Учебники 3 класс',
         'Русский язык 3 класс', 'Иностранный язык 3 класс', 'Математика 3 класс', 'Чтение 3 класс',
         'Окружающий мир 3 класс', 'Изобразительное искусство (ИЗО) 3 класс', 'Информатика 3 класс', 'Музыка 3 класс',
         'Технология 3 класс', 'Физкультура 3 класс', 'Учебники 4 класс', 'Русский язык 4 класс', 'Чтение 4 класс',
         'Окружающий мир 4 класс', 'Математика 4 класс', 'Иностранный язык 4 класс', 'Физкультура 4 класс',
         'Изобразительное искусство (ИЗО) 4 класс', 'Информатика 4 класс', 'Музыка 4 класс',
         'Основы культуры России 4 класс', 'Технология 4 класс', 'Учебники 9 класс', 'География 9 класс',
         'Информатика 9 класс', 'Алгебра 9 класс', 'Русский язык 9 класс', 'Обществознание 9 класс',
         'Геометрия 9 класс', 'Физика 9 класс', 'Литература 9 класс', 'Биология 9 класс', 'История 9 класс',
         'Иностранный язык 9 класс', 'Химия 9 класс', 'Изобразительное искусство (ИЗО) 9 класс',
         'Основы безопасности жизнедеятельности (ОБЖ) 9 класс', 'Технология 9 класс', 'Физкультура 9 класс',
         'Черчение 9 класс', 'Экология 9 класс', 'Учебные программы', 'Учебники 5 класс', 'Иностранный язык 5 класс',
         'Литература 5 класс', 'Русский язык 5 класс', 'Математика 5 класс', 'География 5 класс', 'Информатика 5 класс',
         'История 5 класс', 'Обществознание 5 класс', 'Биология 5 класс', 'Естествознание 5 класс',
         'Изобразительное искусство (ИЗО) 5 класс', 'Музыка 5 класс',
         'Основы безопасности жизнедеятельности (ОБЖ) 5 класс', 'Основы культуры России 5 класс',
         'Природоведение 5 класс', 'Технология 5 класс', 'Физкультура 5 класс', 'Учебники 1 класс',
         'Русский язык 1 класс', 'Чистописание 1 класс', 'Чтение 1 класс', 'Математика 1 класс',
         'Окружающий мир 1 класс', 'Изобразительное искусство (ИЗО) 1 класс', 'Иностранный язык 1 класс',
         'Информатика 1 класс', 'Музыка 1 класс', 'Технология 1 класс', 'Физкультура 1 класс', 'Учебники 8 класс',
         'Информатика 8 класс', 'География 8 класс', 'Иностранный язык 8 класс', 'Геометрия 8 класс',
         'Русский язык 8 класс', 'Алгебра 8 класс', 'Химия 8 класс', 'История 8 класс', 'Биология 8 класс',
         'Изобразительное искусство (ИЗО) 8 класс', 'Литература 8 класс', 'Обществознание 8 класс',
         'Основы безопасности жизнедеятельности (ОБЖ) 8 класс', 'Технология 8 класс', 'Физика 8 класс',
         'Физкультура 8 класс', 'Экология 8 класс', 'Школьные учебники по французскому языку', 'Учебники 7 класс',
         'Информатика 7 класс', 'Геометрия 7 класс', 'Иностранный язык 7 класс', 'География 7 класс', 'Алгебра 7 класс',
         'Обществознание 7 класс', 'Биология 7 класс', 'Русский язык 7 класс', 'История 7 класс', 'Физика 7 класс',
         'Литература 7 класс', 'Изобразительное искусство (ИЗО) 7 класс', 'Музыка 7 класс',
         'Основы безопасности жизнедеятельности (ОБЖ) 7 класс', 'Технология 7 класс', 'Физкультура 7 класс',
         'Химия 7 класс', 'Учебники 6 класс', 'Иностранный язык 6 класс', 'Информатика 6 класс', 'Русский язык 6 класс',
         'Математика 6 класс', 'Литература 6 класс', 'Обществознание 6 класс', 'История 6 класс', 'Биология 6 класс',
         'География 6 класс', 'Изобразительное искусство (ИЗО) 6 класс', 'Музыка 6 класс',
         'Основы безопасности жизнедеятельности (ОБЖ) 6 класс', 'Технология 6 класс', 'Физкультура 6 класс',
         'Школьные учебники по русскому языку', 'Школьные учебники по истории', 'Школьные учебники по обществознанию',
         'Список школьной литературы 9 класс', 'Школьные учебники по геометрии', 'Школьные учебники по математике',
         'Школьные учебники по окружающему миру', 'Школьные учебники по физике', 'Школьные учебники по географии',
         'Школьные учебники по химии', 'Список школьной литературы 5-6 класс', 'Школьные учебники по чистописанию',
         'Школьные учебники по литературе', 'Школьные учебники по биологии', 'Школьные учебники по чтению',
         'Школьные учебники по информатике', 'Список школьной литературы 7-8 класс',
         'Школьные учебники по немецкому языку', 'Литература для внеклассного чтения',
         'Школьные учебники по астрономии', 'Школьные учебники по алгебре', 'Школьные учебники по естествознанию',
         'Школьные учебники по изобразительному искусству (ИЗО)', 'Школьные учебники по краеведению',
         'Школьные учебники по мировой художественной культуре (МХК)', 'Школьные учебники по музыке',
         'Школьные учебники по основам безопасности жизнедеятельности (ОБЖ)',
         'Школьные учебники по основам нравственной культуры России', 'Школьные учебники по правоведению',
         'Зарубежная образовательная литература', 'Учебно-методические пособия (методички)',
         'Прочая образовательная литература', 'Технические науки', 'Эксплуатация промышленного оборудования',
         'Техническая литература', 'Информатика и вычислительная техника', 'Строительство', 'Строительные конструкции',
         'Проектирование в строительстве', 'Архитектурные конструкции', 'Отдельные виды строительства',
         'Технология строительного производства', 'Основы строительства', 'Строительные материалы',
         'Благоустройство территории', 'Проектирование', 'Пищевая промышленность', 'Общественное питание',
         'Пищевое производство', 'Эпидемиология', 'Безалкогольные напитки', 'Хлебопечение', 'Бродильные производства',
         'Производство птицы', 'Гигиена', 'Кондитерское производство', 'Крахмалопаточное производство',
         'Крупяное производство', 'Мукомольное производство', 'Переработка плодов, овощей',
         'Производство вкусовых продуктов', 'Производство консервов', 'Производство молока', 'Производство мяса',
         'Производство рыбы', 'Сахарное производство', 'Радиоэлектроника', 'Электроника', 'Кибернетика',
         'Автоматика и телемеханика', 'Радиотехника', 'Электрическая связь', 'Квантовая электроника', 'Радиолокация',
         'Электроакустика', 'Машиностроение', 'Транспорт', 'Автотранспорт', 'Водный транспорт', 'Городской транспорт',
         'Космический транспорт', 'Воздушный транспорт', 'Железнодорожный транспорт', 'Промышленный транспорт',
         'Трубопроводный транспорт', 'Энергетика', 'Электроэнергетика', 'Топливно-энергетический комплекс',
         'Теплоэнергетика', 'Атомная энергетика', 'Гидроэнергетика', 'Сжатые и разреженные газы', 'Высокие технологии',
         'Технологии металлов', 'Металловедение', 'Производство металлических изделий', 'Металлургия',
         'Химическая технология', 'Процессы и аппараты химической технологии', 'Технология органических веществ',
         'Технология неорганических веществ', 'Материаловедение', 'Приборостроение', 'Основы производства',
         'Нормативная документация', 'Промышленность', 'Горное дело', 'Обогащение полезных ископаемых',
         'Разработка месторождений', 'Общетехнические дисциплины', 'Легкая промышленность', 'Конструкции',
         'Безопасность жизнедеятельности', 'Практикумы', 'Монографии', 'Сельское и лесное хозяйство',
         'Лесное хозяйство', 'Сельское хозяйство', 'Ветеринария', 'Растениеводство', 'Животноводство', 'Агрохимия',
         'Охотничье хозяйство', 'Рыбное хозяйство', 'Учебники и пособия для ссузов', 'Военное дело', 'Задачники',
         'Научные труды', 'Материалы конференций', 'Научные доклады', 'Авторефераты диссертаций',
         'Словари, справочники', 'Руководства', 'Самоучители', 'Энциклопедии', 'Зарубежная справочная литература',
         'Справочники', 'Компьютерная справочная литература', 'Научные справочники', 'Другие справочники',
         'Популярные справочники', 'Технические справочники', 'Учебные справочники', 'Биографические справочники',
         'Бытовые справочники', 'Библиографические справочники', 'Биобиблиографические справочники',
         'Общественно-политические справочники', 'Производственно-практические издания', 'Словари',
         'Энциклопедические словари', 'Языковые словари', 'Другие словари', 'Разговорники', 'Терминологические словари',
         'Этимологические словари', 'Толковые словари', 'Орфографические словари', 'Орфоэпические словари',
         'Идеографические словари', 'Частотные словари', 'Справочная литература', 'Истории из жизни',
         'Компьютерная литература', 'Зарубежная компьютерная литература', 'Программирование', 'Программы',
         'Базы данных', 'Интернет', 'Книги о компьютерах', 'ОС и сети', 'Компьютерная справочная литература',
         'Информационная безопасность', 'Компьютерное железо', 'Культура и искусство', 'Изучение языков',
         'Английский язык', 'Иностранные языки', 'Русский язык как иностранный', 'Немецкий язык', 'Французский язык',
         'Испанский язык', 'Итальянский язык', 'Польский язык'}

allSets = {'detectives': detectives, 'love_romane': love_romane, 'erotic': erotic, 'horror': horror,
           'thriller': thriller, 'humor': humor, 'adventure': adventure, 'classic': classic, 'poetry': poetry,
           'play': play, 'history': history, 'popular_science': popular_science, 'esoterics': esoterics,
           'culture': culture, 'parents': parents, 'health': health, 'business': business, 'fantasy': fantasy,
           'hobby': hobby, 'periodics': periodics, 'psychology': psychology, 'religion': religion, 'study': study}


def get_main_genre(genre):
    for key, value in allSets.items():
        if genre in value:
            return key
    return ''
